In [1]:
import pandas as pd

In [2]:
data = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [3]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
list('321')

['3', '2', '1']

In [5]:
# Cria índice e colunas
df = pd.DataFrame(data, list('321'), list('ZYX'))

In [7]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [8]:
# Organiza pelo índice da linha
df.sort_index(inplace = True)

In [9]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [51]:
df.sort_index(inplace = True, axis = 1)

In [50]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [16]:
df.sort_values(by = ['X', 'Y'], inplace = True)

In [52]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [15]:
df.sort_values(by = '3', axis = 1, inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

## Desafio Alura

In [21]:
data_0 = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [22]:
data_0

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [26]:
df_1 = pd.DataFrame(data_0, list('ZYX'), list('CBA'))
df_1

   C  B  A
Z  1  2  3
Y  4  5  6
X  7  8  9

In [25]:
df_1.sort_index(inplace = True, axis = 1)
df_1

   X  Y  Z
C  3  2  1
B  6  5  4
A  9  8  7

In [27]:
df_1.sort_index(inplace = True, axis = 1)
df_1

   A  B  C
Z  3  2  1
Y  6  5  4
X  9  8  7

In [28]:
df_1.sort_index()
df_1.sort_index(axis = 1)
df_1

   A  B  C
Z  3  2  1
Y  6  5  4
X  9  8  7

In [30]:
df_1.sort_index(inplace = True, axis = 1)

In [31]:
df_1

   A  B  C
Z  3  2  1
Y  6  5  4
X  9  8  7

In [43]:
df_1.sort_index(inplace = True, axis = 1)
df_1

   A  B  C
Z  3  2  1
Y  6  5  4
X  9  8  7

In [48]:
df_1.sort_values(by = ['B', 'A'], inplace = True, axis = 0)
df_1

   A  B  C
Z  3  2  1
Y  6  5  4
X  9  8  7